assignment1/benchmarks/localmachine/disk_benchmark_write_2017-06-12:20:40:55.out
write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-2.20
Starting 4 processes
write: Laying out IO file (1 file / 64MiB)
write: Laying out IO file (1 file / 64MiB)
write: Laying out IO file (1 file / 64MiB)
[...]

write: (groupid=0, jobs=4): err= 0: pid=61353: Mon Jun 12 20:41:36 2017
  write: IOPS=161k, BW=627MiB/s (658MB/s)(256MiB/408msec)
    clat (usec): min=3, max=17647, avg=22.47, stdev=217.43
     lat (usec): min=3, max=17647, avg=22.68, stdev=217.52
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    5], 20.00th=[    7],
     | 30.00th=[    8], 40.00th=[    8], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[    9], 80.00th=[   10], 90.00th=[   12], 95.00th=[   19],
     | 99.00th=[  290], 99.50th=[  532], 99.90th=[ 3472], 99.95th=[ 4192],
     | 99.99th=[ 7584]
    lat (usec) : 4=0.50%, 10=70.25%, 20=24.37%, 50=2.85%, 100=0.62%
    lat (usec) : 250=0.37%, 500=0.50%, 750=0.19%, 1000=0.07%
    lat (msec) : 2=0.10%, 4=0.13%, 10=0.06%, 20=0.01%
  cpu          : usr=5.41%, sys=38.35%, ctx=3685, majf=0, minf=97
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,65536,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=627MiB/s (658MB/s), 627MiB/s-627MiB/s (658MB/s-658MB/s), io=256MiB (268MB), run=408-408msec