assignment1/benchmarks/localmachine/disk_benchmark_write_2017-06-16:08:26:37.out
write: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-2.20
Starting 4 processes
write: Laying out IO file (1 file / 64MiB)
write: Laying out IO file (1 file / 64MiB)
write: Laying out IO file (1 file / 64MiB)
[...]

write: (groupid=0, jobs=4): err= 0: pid=45246: Fri Jun 16 08:27:11 2017
  write: IOPS=177k, BW=692MiB/s (726MB/s)(256MiB/370msec)
    clat (usec): min=3, max=7954, avg=20.78, stdev=217.57
     lat (usec): min=3, max=7954, avg=20.94, stdev=217.58
    clat percentiles (usec):
     |  1.00th=[    4],  5.00th=[    4], 10.00th=[    4], 20.00th=[    5],
     | 30.00th=[    6], 40.00th=[    7], 50.00th=[    8], 60.00th=[    9],
     | 70.00th=[   10], 80.00th=[   11], 90.00th=[   12], 95.00th=[   16],
     | 99.00th=[   91], 99.50th=[  390], 99.90th=[ 4384], 99.95th=[ 5600],
     | 99.99th=[ 7072]
    lat (usec) : 4=0.47%, 10=69.15%, 20=26.50%, 50=2.44%, 100=0.50%
    lat (usec) : 250=0.29%, 500=0.32%, 750=0.06%, 1000=0.04%
    lat (msec) : 2=0.03%, 4=0.07%, 10=0.13%
  cpu          : usr=4.93%, sys=39.39%, ctx=3218, majf=0, minf=104
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,65536,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=692MiB/s (726MB/s), 692MiB/s-692MiB/s (726MB/s-726MB/s), io=256MiB (268MB), run=370-370msec